# CanEnableWorksharing Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..CanEnableWorksharing Method
Document Class See Also
---
Checks if worksharing can be enabled in the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool CanEnableWorksharing()
```

Visual Basic
---
```text
Public Function CanEnableWorksharing As Boolean
```

Visual C++
---
```text
public:
bool CanEnableWorksharing()
```

# ### Return Value
True if worksharing can be enabled in the document, False otherwise.
# See Also
Document Class
Autodesk.Revit.DB Namespace